-- MySQL dump 10.13  Distrib 5.5.62, for Linux (x86_64)
--
-- Host: localhost    Database: jdbc
-- ------------------------------------------------------
-- Server version	5.5.62-log

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `tray_enterlog`
--

DROP TABLE IF EXISTS `tray_enterlog`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `tray_enterlog` (
  `Id` int(11) NOT NULL AUTO_INCREMENT,
  `date` varchar(255) NOT NULL DEFAULT '',
  `name` varchar(255) NOT NULL DEFAULT '',
  `type` varchar(255) NOT NULL DEFAULT '',
  `number` int(11) NOT NULL DEFAULT '0',
  `notes` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`Id`)
) ENGINE=MyISAM AUTO_INCREMENT=59 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tray_enterlog`
--

LOCK TABLES `tray_enterlog` WRITE;
/*!40000 ALTER TABLE `tray_enterlog` DISABLE KEYS */;
INSERT INTO `tray_enterlog` VALUES (27,'2023-05-21 14:42:00','Anman','通用Tray',1240,'R2'),(28,'2023-05-26 10:09:00','ELM','通用Tray',1023,''),(29,'2023-05-26 14:55:00','Max','CGTray',1,''),(30,'2023-05-27 16:17:00','Elm','通用Tray',2449,'R1 黄色版本  Yew项目OLB段使用'),(31,'2023-05-27 18:25:00','YEW','通用Tray',1680,'堆场领入非新购买'),(32,'2023-05-31 10:28:00','Leeds','通用Tray',840,''),(33,'2023-05-31 10:28:00','Leeds','A-Lami下料Tray',1305,'黄色版本'),(34,'2023-06-02 16:49:00','Leeds','A-Lami下料Tray',692,'黄色'),(35,'2023-06-02 16:49:00','Leeds','通用Tray',1925,''),(36,'2023-06-02 16:49:00','Leeds','CGTray',581,''),(37,'2023-06-04 10:35:00','Leeds','CGTray',1015,''),(38,'2023-06-04 10:35:00','Leeds','通用Tray',1365,''),(39,'2023-06-04 10:35:00','Leeds','通用Tray',3213,''),(40,'2023-06-04 10:35:00','Leeds','PBC下料Tray',1244,''),(41,'2023-06-04 21:58:00','Bali','通用Tray',1887,''),(42,'2023-06-08 21:17:00','YEW','通用Tray',4612,'堆场领入'),(43,'2023-06-08 21:17:00','YEW','切割',428,'堆场领入'),(44,'2023-06-12 21:51:00','Oak','通用Tray',538,''),(45,'2023-06-12 21:51:00','Oak','CGTray',334,''),(46,'2023-06-12 21:51:00','Elm','通用Tray',1205,'黄色 Yew项目PLB段使用'),(47,'2023-06-12 21:51:00','YEW','通用Tray',840,'堆场转回'),(48,'2023-06-12 21:51:00','Leeds','通用Tray',210,''),(49,'2023-06-15 21:35:00','Leeds','通用Tray',2290,''),(50,'2023-06-15 21:35:00','Amber','平贴',61,''),(51,'2023-06-15 21:35:00','Amber','CGTray',57,''),(52,'2023-06-15 21:35:00','Elm','CGTray',46,''),(53,'2023-06-15 21:35:00','Elm','POL下料Tray',24,''),(54,'2023-06-15 21:35:00','Anman','POL下料Tray',39,''),(55,'2023-06-15 21:35:00','Amber','切割',22,''),(56,'2023-06-16 14:49:00','Bali','通用Tray',930,'');
/*!40000 ALTER TABLE `tray_enterlog` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tray_info`
--

DROP TABLE IF EXISTS `tray_info`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `tray_info` (
  `Id` int(11) NOT NULL AUTO_INCREMENT,
  `tray_name` varchar(255) NOT NULL DEFAULT '',
  `tray_type` varchar(255) NOT NULL DEFAULT '0',
  `tray_number` varchar(255) NOT NULL DEFAULT '',
  `tray_inside` int(11) NOT NULL DEFAULT '0',
  `tray_outside` int(11) NOT NULL DEFAULT '0',
  `deleted` int(1) NOT NULL DEFAULT '0',
  PRIMARY KEY (`Id`)
) ENGINE=MyISAM AUTO_INCREMENT=3979 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tray_info`
--

LOCK TABLES `tray_info` WRITE;
/*!40000 ALTER TABLE `tray_info` DISABLE KEYS */;
INSERT INTO `tray_info` VALUES (3804,'Max','平贴','C00008472',0,0,0),(3805,'Max','切割','C00008473',0,0,0),(3806,'Max','3D贴合','C00008474',0,0,0),(3807,'Max','CGTray','C00008475',0,0,0),(3808,'Eagle','通用Tray','C00029976',0,0,0),(3809,'Eagle','CGTray','C00032270',0,0,0),(3810,'Phoenix','通用Tray','C00035922',0,0,0),(3811,'Phoenix','CGTray','C00034933',0,0,0),(3812,'Nadia','平贴','C00038323',0,0,0),(3813,'Nadia','3D贴合','C00038324',0,0,0),(3814,'Nadia','CGTray','C00038325',0,0,0),(3815,'Jewel','CGTray','C00041128',0,3060,0),(3816,'Jewel','切割','C00046170',0,1465,0),(3817,'Jewel','通用Tray','C00041127',0,1156,0),(3818,'Columbus','CGTray','C00049374',128,0,0),(3819,'Columbus','通用Tray','C00042273',154,0,0),(3820,'Leap','通用Tray','C00039828',0,0,0),(3821,'Leap','CGTray','C00039827',0,0,0),(3822,'Leap','PBC下料Tray','C00073153',0,0,0),(3823,'Venice','CGTray','C00038099',0,0,0),(3824,'Bravo','CGTray','C00046554',0,0,0),(3825,'Summer','平贴','C00046935',0,2150,0),(3826,'Summer','3D贴合','C00046934',353,3680,0),(3827,'Summer','绑定','C00046933',0,1760,0),(3828,'Summer','CGTray','C00060597',0,0,0),(3829,'Summer','切割','C00046932',252,4500,0),(3830,'Sirius','CGTray','C00050239',1139,0,0),(3831,'Sirius','通用Tray','C00050313',0,1070,0),(3832,'Sirius','切割','C00051393',0,0,0),(3833,'Sirius','绑定','C00050336',0,88,0),(3834,'Yala','通用Tray','C00051350',465,0,0),(3835,'Yala','CGTray','C00051351',1361,0,0),(3836,'Yala','POL下料Tray','C00070173',928,0,0),(3837,'Zurich','通用Tray','C00051627',0,1080,0),(3838,'Zurich','CGTray','C00051626',2883,2040,0),(3839,'Berlin','CGTray','C00052791',0,0,0),(3840,'Berlin','通用Tray','C00052790',0,0,0),(3841,'Berlin','切割','C00060079',0,0,0),(3842,'Berlin','POL下料Tray','C00058937',0,0,0),(3843,'通用平Tray','平贴','C00018601',0,2843,0),(3844,'Milan','CGTray','C00053403',4119,840,0),(3845,'Milan','通用Tray','C00053402',660,245,0),(3846,'Milan','切割','C00060078',0,482,0),(3847,'Milan','IC','C00076233',500,0,0),(3848,'Polaris','通用Tray','C00055379',0,0,0),(3849,'Polaris','CGTray','C00055378',0,0,0),(3850,'Polaris','切割','C00055380',0,0,0),(3851,'Davos','通用Tray','C00056256',0,1146,0),(3852,'Davos','CGTray','C00056257',0,0,0),(3853,'Navy','通用Tray','C00058159',0,0,0),(3854,'Navy','CGTray','C00058160',0,0,0),(3855,'Navy','POL下料Tray','C00061609',0,0,0),(3856,'Ginkgo','组装Tray','C00057660',0,0,0),(3857,'Ginkgo','组装Tray1','C00057661',0,0,0),(3858,'Lisbon','组装Tray','C00058402',0,0,0),(3859,'Dubai','通用Tray','C00061563',0,420,0),(3860,'Doha','通用Tray','C00061455',7485,0,0),(3861,'Doha','POL下料Tray','C00061841',2237,1320,0),(3862,'Cario','通用Tray','C00061251',148,306,0),(3863,'Cario','切割','C00070655',0,714,0),(3864,'Cario','CGTray','C00061252',0,150,0),(3865,'Maple','通用Tray','C00062054',0,0,0),(3866,'Maple','POL下料Tray','C08872746',0,0,0),(3867,'Legend','平贴','C00062115',78,2855,0),(3868,'Legend','CGTray','C00056019',295,1033,0),(3869,'Legend','通用Tray','C00056020',3256,130,0),(3870,'Fir','通用Tray','C00067947',597,654,0),(3871,'Fir','CGTray','C00070172',0,0,0),(3872,'Fir','POL下料Tray','C00070171',142,0,0),(3873,'COCO','绑定上料Tray','C00069464',1664,0,0),(3874,'COCO','切割','C00069463',163,665,0),(3875,'COCO','绑定下料Tray','C00069465',2641,315,0),(3876,'COCO','3D贴合','C00069461',4821,0,0),(3877,'COCO','保护膜下料Tray','C00069466',0,0,0),(3878,'COCO','OCA下料Tray','C00069462',597,0,0),(3879,'COCO','CGTray','C00069519',1699,2065,0),(3880,'COCO','BKT上料','C00081384',1008,0,0),(3881,'YAYA','POL下料Tray','C00070173',2,0,0),(3882,'YEW','通用Tray','C00070281',19261,1252,0),(3883,'YEW','CGTray','C00070283',7405,840,0),(3884,'YEW','POL下料Tray','C00070282',2765,0,0),(3885,'YEW','切割','C00074804',2172,2108,0),(3886,'Aging','','C00070198',1460,0,0),(3887,'Elm','POL下料Tray','C00071650',3690,24,0),(3888,'Elm','通用Tray','C00071652',27197,0,0),(3889,'Elm','CGTray','C00071651',9795,46,0),(3890,'Elm','切割','C00071882',4327,0,0),(3891,'Elm-C','贴合脱泡Tray','C00082106',1222,0,0),(3892,'Bern','POL下料Tray','C00072762',0,0,0),(3893,'Bern','绑定','C00072763',0,0,0),(3894,'Amber','PBC下料Tray','C00072908',0,1260,0),(3895,'Amber','CGTray','C00072764',433,1072,0),(3896,'Amber','切割','C00072909',80,1282,0),(3897,'Amber','3D贴合','C00072917',0,0,0),(3898,'Amber','平贴','C00072765',115,1741,0),(3899,'Amber','2.5D贴合','C00075058',29,2956,0),(3900,'SKY','通用Tray','C00073067',5716,0,0),(3901,'SKY','CGTray','C00073066',3030,71,0),(3902,'SKY','PBC下料Tray','C00073068',1204,0,0),(3903,'Tiger','平贴','C00012904',1678,4945,0),(3904,'Tiger','CGTray','C00012907',0,2621,0),(3905,'Tiger','切割','C00012905',12,2085,0),(3906,'Tiger','3D贴合','C00037596',78,2020,0),(3907,'Tiger','脱泡专用','C00073934',0,1640,0),(3908,'Poplar','通用Tray','C00048554',0,0,0),(3909,'Poplar','平贴','C00052982',0,0,0),(3910,'Poplar','CGTray','C00052983',0,0,0),(3911,'COCOnut','切割','C00071003',0,0,0),(3912,'COCOnut','POL下料Tray','C00071002',0,0,0),(3913,'COCOnut','OLB上料','C00071001',0,0,0),(3914,'COCOnut-S','3D贴合','C00071411',0,0,0),(3915,'COCOnut-L','3D贴合','C00071230',0,0,0),(3916,'COCOnut-S','CGTray','C00071409',0,0,0),(3917,'COCOnut-L','CGTray','C00071163',0,0,0),(3918,'COCOnut-S','组装Tray','C00071407',0,0,0),(3919,'COCOnut-L','组装Tray','C00071164',0,0,0),(3920,'Cedar','通用Tray','C00049716',0,0,0),(3921,'Cedar','CGTray','C00051403',0,0,0),(3922,'Mecca','3D贴合','C00077244',575,340,0),(3923,'Willow','指纹Tray','C00077089',688,0,0),(3924,'Willow','IC','C00077090',62,606,0),(3925,'Bamboo','指纹Tray','C00077091',0,2509,0),(3926,'Holly-L','3D贴合','C00077308',105,1075,0),(3927,'Holly-L','CGTray','C00077060',0,0,0),(3928,'Holly-L','组装Tray','C00077307',0,0,0),(3929,'Holly','OLB上料','C00077061',0,0,0),(3930,'Holly','切割','C00077309',0,100,0),(3931,'Holly','POL下料Tray','C00077062',0,0,0),(3932,'Holly-S','CGTray','C00077059',58,392,0),(3933,'Holly-S','3D贴合','c00077306',0,0,0),(3934,'Holly-S','组装Tray','C00077305',0,0,0),(3935,'Anman','POL下料Tray','C00077190',1505,0,0),(3936,'Anman','通用Tray','C00077191',6382,0,0),(3937,'Anman','CGTray','C00077192',3108,340,0),(3938,'Koln','通用Tray','C00067172',0,0,0),(3939,'Koln','CGTray','C00067173',0,0,0),(3940,'Elm-E','通用Tray','C00080339',7490,0,0),(3941,'Elm-E','CGTray','C00080338',3419,0,0),(3942,'Bali','通用Tray','C00080655',6129,0,0),(3943,'Bali','PBC下料Tray','C00080654',1203,0,0),(3944,'Bali','CGTray','C00080656',2303,0,0),(3945,'Jewel-T','通用Tray','C00080823',768,0,0),(3946,'Jewel-T','CGTray','C00080821',475,0,0),(3947,'Jewel-T','切割','C00080822',461,0,0),(3948,'Jewel-T','PBC下料Tray','C00080820',479,0,0),(3949,'Leeds','通用Tray','C00081635',15091,0,0),(3950,'Leeds','CGTray','C00081636',5027,0,0),(3951,'Leeds','PBC下料Tray','C00081632',2629,0,0),(3952,'Leeds','A-Lami下料Tray','C00081633',2968,0,0),(3953,'Sana','绑定下料Tray','C00082343',499,0,0),(3954,'Sana','CGTray','C00082346',499,0,0),(3955,'Sana','3D贴合','C00082344',743,0,0),(3956,'Sana','PBC下料Tray','C00082348',497,0,0),(3957,'Sana','切割','C00082799',746,0,0),(3958,'Sana','OCA下料Tray','C00082345',496,0,0),(3959,'通用','CGTray','C00081603',98,0,0),(3960,'Wood','TGP下料Tray','C00083429',298,0,0),(3961,'Oak','CGTray','C00084225',873,0,0),(3962,'Oak','通用Tray','C00084223',1354,0,0),(3963,'DILI','CGTray','C00050670',0,0,0),(3964,'Anson','通用Tray','C00080367',0,0,0),(3965,'NARA','通用Tray','C00071883',0,0,0),(3966,'Anson','PBC下料Tray','C00080369',0,0,0),(3967,'Anson','CGTray','C00080370',0,0,0),(3968,'NARA','CGTray','C00071884',0,0,0),(3969,'Anson','A-Lami下料Tray','C00080368',0,0,0),(3970,'Anson','3D贴合','C00080437',0,0,0),(3971,'Damman','通用Tray','C00070471',0,0,0),(3972,'Damman','CGTray','C00070472',0,0,0),(3973,'Holly','IC','C00077381',0,0,0),(3976,'NARA','贴合Tray','C00078084',0,0,0),(3975,'DILI','3D贴合','C00050672',0,0,0),(3978,'Legend','指纹Tray','C00073337',0,0,0);
/*!40000 ALTER TABLE `tray_info` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tray_nglog`
--

DROP TABLE IF EXISTS `tray_nglog`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `tray_nglog` (
  `Id` int(11) NOT NULL AUTO_INCREMENT,
  `date` varchar(255) NOT NULL DEFAULT '',
  `name` varchar(255) NOT NULL DEFAULT '',
  `type` varchar(255) NOT NULL DEFAULT '',
  `number` varchar(255) NOT NULL DEFAULT '',
  `notes` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`Id`)
) ENGINE=MyISAM AUTO_INCREMENT=253 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tray_nglog`
--

LOCK TABLES `tray_nglog` WRITE;
/*!40000 ALTER TABLE `tray_nglog` DISABLE KEYS */;
INSERT INTO `tray_nglog` VALUES (10,'2023-05-25 08:53:00','OAK','通用Tray','3',''),(11,'2023-05-25 08:53:00','Anman','通用Tray','24',''),(12,'2023-05-25 08:53:00','Yew','通用Tray','151',''),(13,'2023-05-25 08:53:00','Anman','POL下料Tray','17',''),(14,'2023-05-25 08:53:00','Yew','POL下料Tray','4',''),(15,'2023-05-25 08:53:00','Yew','CGTray','174',''),(16,'2023-05-25 08:53:00','Yew','切割','14',''),(17,'2023-05-25 08:53:00','Summer','3D贴合','82',''),(18,'2023-05-25 08:53:00','Summer','绑定','19',''),(19,'2023-05-25 08:53:00','Summer','切割','3',''),(20,'2023-05-25 08:53:00','Summer','平贴','10',''),(21,'2023-05-25 08:53:00','Poplar','通用Tray','16',''),(22,'2023-05-25 08:53:00','Elm','通用Tray','129',''),(23,'2023-05-25 08:53:00','Elm','CGTray','204',''),(24,'2023-05-25 08:53:00','Elm','POL下料Tray','9',''),(25,'2023-05-25 08:53:00','Elm','切割','54',''),(26,'2023-05-25 08:53:00','Elm','IC','3',''),(27,'2023-05-25 08:53:00','COCO','OCA下料Tray','9',''),(28,'2023-05-25 08:53:00','COCO','切割','12',''),(29,'2023-05-25 08:53:00','COCO','BKT上料','55',''),(30,'2023-05-25 08:53:00','COCO','3D贴合','29',''),(31,'2023-05-25 08:53:00','COCO','绑定上料Tray','9',''),(32,'2023-05-25 08:53:00','COCO','绑定下料Tray','5',''),(33,'2023-05-25 08:53:00','COCO','CGTray','11',''),(34,'2023-05-25 08:53:00','ELM-E','CGTray','11',''),(35,'2023-05-25 08:53:00','ELM-E','通用Tray','84',''),(36,'2023-05-25 08:53:00','Doha','通用Tray','11',''),(37,'2023-05-25 08:53:00','Doha','POL下料Tray','11',''),(38,'2023-05-25 08:53:00','ELM-C','贴合脱泡Tray','8',''),(39,'2023-05-25 08:53:00','Zurich','通用Tray','1',''),(40,'2023-05-25 08:53:00','Zurich','CGTray','69',''),(41,'2023-05-25 08:53:00','Mecca','3D贴合','2',''),(42,'2023-05-25 08:53:00','Tiger','平贴','9',''),(43,'2023-05-25 08:53:00','Tiger','切割','1',''),(44,'2023-05-25 08:53:00','Leap','通用Tray','2',''),(45,'2023-05-25 08:53:00','Davos','通用Tray','1',''),(46,'2023-05-25 08:53:00','Cario','通用Tray','4',''),(47,'2023-05-25 08:53:00','Sky','通用Tray','21',''),(48,'2023-05-25 08:53:00','Sky','CGTray','8',''),(49,'2023-05-25 08:53:00','Amber','切割','1',''),(50,'2023-05-25 08:53:00','Amber','平贴','4',''),(51,'2023-05-25 08:53:00','Amber','PBC下料Tray','8',''),(52,'2023-05-25 08:53:00','Amber','CGTray','1',''),(53,'2023-05-25 08:53:00','Amber','2.5D贴合','2',''),(54,'2023-05-25 08:53:00','Yala','通用Tray','10',''),(55,'2023-05-25 08:53:00','Yala','CGTray','39',''),(56,'2023-05-25 08:53:00','Porto','通用Tray','2',''),(57,'2023-05-25 08:53:00','Porto','通用Tray','2',''),(58,'2023-05-25 08:53:00','Jewel','通用Tray','1',''),(59,'2023-05-25 08:53:00','Jewel','CGTray','2',''),(60,'2023-05-25 08:53:00','Berlin','CGTray','10',''),(61,'2023-05-25 08:53:00','Bali','通用Tray','5',''),(62,'2023-05-25 08:53:00','Bali','PBC下料Tray','3',''),(63,'2023-05-25 08:53:00','Sirius','通用Tray','1',''),(64,'2023-05-25 08:53:00','Sirius','绑定','1',''),(65,'2023-05-25 08:53:00','Leeds','通用Tray','2',''),(66,'2023-05-26 14:56:00','Max','CGTray','1',''),(67,'2023-06-06 03:42:00','Eagle','通用Tray','2',''),(68,'2023-06-06 03:42:00','Eagle','CGTray','183',''),(69,'2023-06-06 03:42:00','Jewel','CGTray','17',''),(70,'2023-06-06 03:42:00','Columbus','CGTray','72',''),(71,'2023-06-06 03:42:00','Columbus','通用Tray','112',''),(72,'2023-06-06 03:42:00','Leap','通用Tray','5',''),(73,'2023-06-06 03:42:00','Summer','平贴','60',''),(74,'2023-06-06 03:42:00','Summer','3D贴合','48',''),(75,'2023-06-06 03:42:00','Summer','绑定','8',''),(76,'2023-06-06 03:42:00','Summer','切割','61',''),(77,'2023-06-06 03:42:00','Sirius','通用Tray','146',''),(78,'2023-06-06 03:42:00','Sirius','CGTray','128',''),(79,'2023-06-06 03:42:00','Sirius','绑定','113',''),(80,'2023-06-06 03:42:00','Yala','通用Tray','4',''),(81,'2023-06-06 03:42:00','Yala','CGTray','21',''),(82,'2023-06-06 03:42:00','Zurich','通用Tray','8',''),(83,'2023-06-06 03:42:00','Zurich','CGTray','20',''),(84,'2023-06-06 03:42:00','Berlin','POL下料Tray','5',''),(85,'2023-06-06 03:42:00','Milan','CGTray','28',''),(86,'2023-06-06 03:42:00','Milan','通用Tray','7',''),(87,'2023-06-06 03:42:00','Davos','通用Tray','3',''),(88,'2023-06-06 03:42:00','Dubai','通用Tray','3',''),(89,'2023-06-06 03:42:00','Doha','通用Tray','35',''),(90,'2023-06-06 03:42:00','Doha','POL下料Tray','19',''),(91,'2023-06-06 03:42:00','Cario','通用Tray','358',''),(92,'2023-06-06 03:42:00','Cario','切割','93',''),(93,'2023-06-06 03:42:00','Legend','通用Tray','1',''),(94,'2023-06-06 03:42:00','Fir','通用Tray','9',''),(95,'2023-06-06 03:42:00','COCO','绑定上料Tray','11',''),(96,'2023-06-06 03:42:00','COCO','切割','33',''),(97,'2023-06-06 03:42:00','COCO','绑定下料Tray','4',''),(98,'2023-06-06 03:42:00','COCO','3D贴合','24',''),(99,'2023-06-06 03:42:00','COCO','OCA下料Tray','7',''),(100,'2023-06-06 03:42:00','COCO','CGTray','4',''),(101,'2023-06-06 03:42:00','YEW','通用Tray','454',''),(102,'2023-06-06 03:42:00','YEW','CGTray','133',''),(103,'2023-06-06 03:42:00','YEW','POL下料Tray','14',''),(104,'2023-06-06 03:42:00','YEW','切割','33',''),(105,'2023-06-06 03:42:00','Elm','POL下料Tray','27',''),(106,'2023-06-06 03:42:00','Elm','通用Tray','271',''),(107,'2023-06-06 03:42:00','Elm','CGTray','170',''),(108,'2023-06-06 03:42:00','Elm','切割','90',''),(109,'2023-06-06 03:42:00','Elm-C','贴合脱泡Tray','47',''),(110,'2023-06-06 03:42:00','Amber','PBC下料Tray','3',''),(111,'2023-06-06 03:42:00','Amber','切割','7',''),(112,'2023-06-06 03:42:00','Amber','平贴','61',''),(113,'2023-06-06 03:42:00','Amber','2.5D贴合','61',''),(114,'2023-06-06 03:42:00','SKY','通用Tray','56',''),(115,'2023-06-06 03:42:00','SKY','CGTray','2',''),(116,'2023-06-06 03:42:00','SKY','PBC下料Tray','1',''),(117,'2023-06-06 03:42:00','Tiger','CGTray','23',''),(118,'2023-06-06 03:42:00','Mecca','3D贴合','5',''),(119,'2023-06-06 03:42:00','Anman','通用Tray','11',''),(120,'2023-06-06 03:42:00','Anman','CGTray','9',''),(121,'2023-06-06 03:42:00','Elm-E','通用Tray','135',''),(122,'2023-06-06 03:42:00','Elm-E','CGTray','27',''),(123,'2023-06-06 03:42:00','Bali','CGTray','3',''),(124,'2023-06-06 03:42:00','Bali','POL下料Tray','1',''),(125,'2023-06-06 03:42:00','Bali','POL下料Tray','1',''),(126,'2023-06-06 03:42:00','Bali','POL下料Tray','1',''),(127,'2023-06-06 03:42:00','Bali','通用Tray','106',''),(128,'2023-06-06 03:42:00','Jewel-T','通用Tray','1',''),(129,'2023-06-06 03:42:00','Jewel-T','CGTray','3',''),(130,'2023-06-06 03:42:00','Leeds','CGTray','4',''),(131,'2023-06-06 03:42:00','Leeds','通用Tray','46',''),(132,'2023-06-06 03:42:00','Leeds','A-Lami下料Tray','20',''),(133,'2023-06-06 03:42:00','通用','CGTray','2',''),(134,'2023-06-06 03:42:00','Oak','CGTray','11',''),(135,'2023-06-06 03:42:00','Oak','CGTray','1',''),(136,'2023-06-01 04:22:00','Koln','通用Tray','2672','1F项目'),(137,'2023-06-01 04:22:00','Koln','CGTray','2120','1F项目'),(138,'2023-06-06 20:14:00','Sirius','通用Tray','3020','堆场'),(139,'2023-06-06 20:14:00','Sirius','CGTray','3360','堆场'),(140,'2023-06-06 20:14:00','Sirius','切割','1680','堆场'),(141,'2023-06-06 20:14:00','Sirius','绑定','2020','堆场'),(142,'2023-06-13 21:54:00','Yala','通用Tray','7140','转堆场'),(143,'2023-06-13 21:54:00','Yala','CGTray','4620','转堆场'),(144,'2023-06-13 21:54:00','Yala','通用Tray','6720','转堆场'),(145,'2023-06-13 21:54:00','Yala','CGTray','1680','转堆场'),(146,'2023-06-13 21:54:00','Sirius','通用Tray','1680','转堆场'),(147,'2023-06-13 21:54:00','Legend','通用Tray','1680','转堆场'),(148,'2023-06-15 21:43:00','Fir','CGTray','821',''),(149,'2023-06-15 21:43:00','Fir','POL下料Tray','244',''),(150,'2023-06-15 21:43:00','Fir','通用Tray','615',''),(151,'2023-06-15 21:43:00','Legend','通用Tray','840',''),(152,'2023-06-15 21:43:00','Legend','CGTray','840',''),(153,'2023-06-15 21:43:00','Sirius','通用Tray','2610',''),(154,'2023-06-15 21:43:00','Milan','通用Tray','4200',''),(155,'2023-06-15 21:43:00','Milan','切割','840',''),(156,'2023-06-15 21:43:00','Yala','通用Tray','1440',''),(157,'2023-06-15 21:43:00','Tiger','切割','840',''),(158,'2023-06-15 21:43:00','Tiger','平贴','840',''),(159,'2023-06-15 21:43:00','Tiger','3D贴合','1600',''),(160,'2023-06-15 21:43:00','Venice','CGTray','2520',''),(161,'2023-06-16 10:50:00','Elm-E','通用Tray','98',''),(162,'2023-06-16 10:50:00','Elm-E','CGTray','13',''),(163,'2023-06-16 10:50:00','COCO','OCA下料Tray','9',''),(164,'2023-06-16 10:50:00','COCO','BKT上料','24',''),(165,'2023-06-16 10:50:00','COCO','3D贴合','41',''),(166,'2023-06-16 10:50:00','COCO','切割','23',''),(167,'2023-06-16 10:50:00','COCO','绑定下料Tray','4',''),(168,'2023-06-16 10:50:00','COCO','CGTray','2',''),(169,'2023-06-16 10:50:00','Anson','通用Tray','58',''),(170,'2023-06-16 10:50:00','Anson','A-Lami下料Tray','7',''),(171,'2023-06-16 10:50:00','Anson','3D贴合','2',''),(172,'2023-06-16 10:50:00','Anman','通用Tray','36',''),(173,'2023-06-16 10:50:00','Anman','POL下料Tray','2',''),(174,'2023-06-16 10:50:00','Anman','CGTray','7',''),(175,'2023-06-16 10:50:00','Bali','CGTray','10',''),(176,'2023-06-16 10:50:00','Bali','通用Tray','11',''),(177,'2023-06-16 10:50:00','Bali','PBC下料Tray','4',''),(178,'2023-06-16 10:50:00','Leeds','通用Tray','42',''),(179,'2023-06-16 10:50:00','Leeds','A-Lami下料Tray','8',''),(180,'2023-06-16 10:50:00','Leeds','CGTray','31',''),(181,'2023-06-16 10:50:00','Leeds','PBC下料Tray','11',''),(182,'2023-06-16 10:50:00','Elm','通用Tray','217',''),(183,'2023-06-16 10:50:00','Elm','切割','45',''),(184,'2023-06-16 10:50:00','Elm','CGTray','168',''),(185,'2023-06-16 10:50:00','Elm','POL下料Tray','13',''),(186,'2023-06-16 10:50:00','Sana','切割','4',''),(187,'2023-06-16 10:50:00','Sana','3D贴合','2',''),(250,'2023-06-16 15:26:00','Legend','指纹Tray','119',''),(189,'2023-06-16 10:50:00','Sana','绑定下料Tray','1',''),(190,'2023-06-16 10:50:00','YEW','通用Tray','414',''),(191,'2023-06-16 10:50:00','YEW','CGTray','199',''),(192,'2023-06-16 10:50:00','YEW','切割','19',''),(193,'2023-06-16 10:50:00','YEW','POL下料Tray','1',''),(194,'2023-06-16 10:50:00','Amber','切割','5',''),(195,'2023-06-16 10:50:00','Amber','PBC下料Tray','32',''),(196,'2023-06-16 10:50:00','Amber','通用Tray','4',''),(197,'2023-06-16 10:50:00','Amber','CGTray','3',''),(198,'2023-06-16 10:50:00','Amber','A-Lami下料Tray','30',''),(199,'2023-06-16 10:50:00','Amber','2.5D贴合','7',''),(200,'2023-06-16 10:50:00','Amber','平贴','1',''),(201,'2023-06-16 10:50:00','Oak','通用Tray','16',''),(202,'2023-06-16 10:50:00','Oak','CGTray','4',''),(203,'2023-06-16 10:50:00','Wood','TGP下料Tray','2',''),(204,'2023-06-16 10:50:00','Damman','通用Tray','28',''),(205,'2023-06-16 10:50:00','Damman','CGTray','4',''),(206,'2023-06-16 10:50:00','Holly','IC','21',''),(207,'2023-06-16 10:50:00','Jewel','通用Tray','9',''),(208,'2023-06-16 10:50:00','Sirius','绑定','3',''),(209,'2023-06-16 10:50:00','Sirius','通用Tray','45',''),(210,'2023-06-16 10:50:00','Sirius','切割','10',''),(211,'2023-06-16 10:50:00','Sirius','CGTray','2',''),(212,'2023-06-16 10:50:00','Fir','CGTray','40',''),(213,'2023-06-16 10:50:00','Koln','通用Tray','15',''),(214,'2023-06-16 10:50:00','Legend','通用Tray','1',''),(215,'2023-06-16 10:50:00','Willow','IC','32',''),(217,'2023-06-16 10:50:00','NARA','通用Tray','34',''),(218,'2023-06-16 10:50:00','NARA','CGTray','1',''),(220,'2023-06-16 10:50:00','SKY','CGTray','10',''),(221,'2023-06-16 10:50:00','SKY','通用Tray','45',''),(222,'2023-06-16 10:50:00','Jewel-T','切割','13',''),(223,'2023-06-16 10:50:00','Jewel-T','PBC下料Tray','1',''),(224,'2023-06-16 13:25:00','Davos','CGTray','20',''),(225,'2023-06-16 13:25:00','Yala','通用Tray','10',''),(226,'2023-06-16 13:25:00','Yala','CGTray','5',''),(227,'2023-06-16 13:25:00','Summer','绑定','10',''),(228,'2023-06-16 13:25:00','Summer','切割','6',''),(229,'2023-06-16 13:25:00','Summer','3D贴合','4',''),(230,'2023-06-16 13:25:00','Summer','平贴','3',''),(231,'2023-06-16 13:25:00','Bamboo','指纹Tray','13',''),(232,'2023-06-16 13:25:00','Tiger','CGTray','2',''),(233,'2023-06-16 13:25:00','Tiger','切割','2',''),(234,'2023-06-16 13:25:00','Tiger','3D贴合','2',''),(235,'2023-06-16 13:25:00','Tiger','平贴','2',''),(236,'2023-06-16 13:25:00','Berlin','通用Tray','2',''),(237,'2023-06-16 13:25:00','Berlin','CGTray','1',''),(238,'2023-06-16 13:25:00','Cario','通用Tray','1',''),(239,'2023-06-16 13:25:00','Zurich','CGTray','28',''),(240,'2023-06-16 13:26:00','Zurich','CGTray','1',''),(241,'2023-06-16 13:26:00','DILI','3D贴合','1',''),(242,'2023-06-16 13:26:00','Milan','通用Tray','1',''),(243,'2023-06-16 13:26:00','Doha','通用Tray','1',''),(244,'2023-06-16 13:26:00','Doha','POL下料Tray','4',''),(245,'2023-06-16 13:26:00','Elm-C','贴合脱泡Tray','11',''),(246,'2023-06-16 13:26:00','Mecca','3D贴合','7',''),(247,'2023-06-16 15:03:00','Anman','POL下料Tray','499','R0 版本变更'),(248,'2023-06-16 15:26:00','NARA','贴合Tray','1','');
/*!40000 ALTER TABLE `tray_nglog` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tray_outside`
--

DROP TABLE IF EXISTS `tray_outside`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `tray_outside` (
  `Id` int(11) NOT NULL AUTO_INCREMENT,
  `date` varchar(255) NOT NULL DEFAULT '',
  `name` varchar(255) NOT NULL DEFAULT '',
  `type` varchar(255) NOT NULL DEFAULT '',
  `state` int(11) NOT NULL DEFAULT '0' COMMENT '0+ 1-',
  `number` int(11) NOT NULL DEFAULT '0',
  `notes` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`Id`)
) ENGINE=MyISAM AUTO_INCREMENT=105 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tray_outside`
--

LOCK TABLES `tray_outside` WRITE;
/*!40000 ALTER TABLE `tray_outside` DISABLE KEYS */;
INSERT INTO `tray_outside` VALUES (18,'2023-05-21 14:44:00','Anman','通用Tray',1,1240,'R2'),(19,'2023-05-22 14:19:00','COCO','绑定下料Tray',1,630,'R2'),(20,'2023-05-22 14:19:00','Leeds','通用Tray',1,1050,'R0'),(21,'2023-05-23 08:31:00','Amber','平贴',1,1000,''),(22,'2023-05-23 11:09:00','Leeds','通用Tray',1,1610,''),(23,'2023-05-25 15:43:00','COCO','绑定上料Tray',1,1015,''),(24,'2023-05-29 16:47:00','Elm','切割',1,1680,''),(25,'2023-06-02 16:51:00','Leeds','通用Tray',0,1925,''),(26,'2023-06-02 16:51:00','Leeds','A-Lami下料Tray',0,692,'黄色'),(27,'2023-06-04 10:36:00','Leeds','CGTray',0,1015,''),(28,'2023-06-04 10:36:00','Leeds','通用Tray',0,1365,''),(29,'2023-06-04 10:36:00','Leeds','通用Tray',0,3213,''),(33,'2023-06-04 10:36:00','Leeds','PBC下料Tray',0,1244,''),(32,'2023-06-04 10:36:00','Leeds','通用Tray',1,1365,''),(34,'2023-06-05 20:42:00','Leeds','通用Tray',1,1673,''),(35,'2023-06-05 20:42:00','Leeds','CGTray',1,1015,''),(36,'2023-06-06 04:22:00','Koln','通用Tray',1,1840,''),(37,'2023-06-06 04:22:00','Koln','CGTray',1,175,''),(38,'2023-06-06 20:13:00','Leeds','A-Lami下料Tray',1,692,''),(39,'2023-06-06 20:13:00','Sirius','通用Tray',1,3020,''),(40,'2023-06-06 20:13:00','Sirius','CGTray',1,3360,''),(41,'2023-06-06 20:13:00','Sirius','切割',1,1680,''),(42,'2023-06-06 20:13:00','Sirius','绑定',1,2020,''),(43,'2023-06-06 22:42:00','Yala','CGTray',0,3780,''),(44,'2023-06-06 22:42:00','Yala','通用Tray',0,420,''),(45,'2023-06-07 02:37:00','Yala','通用Tray',0,3360,''),(46,'2023-06-06 12:37:00','Yala','通用Tray',0,4200,''),(47,'2023-06-07 11:55:00','Leeds','通用Tray',1,1540,''),(48,'2023-06-07 20:28:00','Yala','通用Tray',0,3120,''),(49,'2023-06-07 20:28:00','Amber','2.5D贴合',0,840,''),(50,'2023-06-08 21:22:00','YEW','通用Tray',0,4612,''),(51,'2023-06-08 21:22:00','YEW','切割',0,428,''),(52,'2023-06-09 11:02:00','Leeds','通用Tray',1,1925,''),(53,'2023-06-10 11:58:00','Fir','CGTray',0,821,''),(54,'2023-06-10 11:58:00','Fir','POL下料Tray',0,244,''),(55,'2023-06-10 11:58:00','Fir','通用Tray',0,769,''),(56,'2023-06-10 11:58:00','Summer','3D贴合',0,3540,''),(57,'2023-06-10 11:58:00','Summer','切割',0,2340,''),(58,'2023-06-10 11:58:00','Summer','平贴',0,1680,''),(59,'2023-06-11 21:50:00','Leeds','PBC下料Tray',1,1244,''),(60,'2023-06-11 21:50:00','Anman','通用Tray',1,1054,''),(61,'2023-06-13 21:50:00','Yala','通用Tray',1,7140,''),(62,'2023-06-13 21:50:00','Yala','CGTray',1,4620,''),(63,'2023-06-14 21:50:00','Summer','切割',0,2160,''),(64,'2023-06-14 21:50:00','Summer','绑定',0,1760,''),(65,'2023-06-14 21:50:00','Summer','3D贴合',0,140,''),(66,'2023-06-14 21:50:00','Summer','平贴',0,470,''),(67,'2023-06-14 21:50:00','Amber','CGTray',0,1015,''),(68,'2023-06-14 21:50:00','Amber','2.5D贴合',0,665,''),(69,'2023-06-14 21:50:00','Amber','平贴',0,1680,''),(70,'2023-06-14 21:50:00','Amber','切割',0,1260,''),(71,'2023-06-14 21:50:00','Amber','PBC下料Tray',0,1260,''),(72,'2023-06-14 21:50:00','Yala','通用Tray',1,6720,''),(73,'2023-06-14 21:50:00','Yala','CGTray',1,1680,''),(74,'2023-06-14 21:50:00','Sirius','通用Tray',1,1680,''),(75,'2023-06-14 21:50:00','Legend','通用Tray',1,1680,''),(76,'2023-06-15 10:53:00','Anman','通用Tray',1,1030,''),(77,'2023-06-15 10:53:00','YEW','通用Tray',1,3360,''),(78,'2023-06-15 10:53:00','Bamboo','指纹Tray',0,1504,''),(79,'2023-06-15 10:53:00','Willow','IC',0,606,''),(80,'2023-06-15 21:37:00','Amber','平贴',0,61,''),(81,'2023-06-15 21:37:00','Amber','CGTray',0,57,''),(82,'2023-06-15 21:37:00','Amber','切割',0,22,''),(83,'2023-06-15 21:37:00','Anman','POL下料Tray',0,39,''),(84,'2023-06-15 21:37:00','Elm','POL下料Tray',0,24,''),(85,'2023-06-15 21:37:00','Elm','CGTray',0,46,''),(86,'2023-06-15 21:37:00','Fir','CGTray',1,821,''),(87,'2023-06-15 21:37:00','Fir','POL下料Tray',1,244,''),(88,'2023-06-15 21:37:00','Fir','通用Tray',1,615,''),(89,'2023-06-15 21:37:00','Legend','通用Tray',1,840,''),(90,'2023-06-15 21:37:00','Legend','CGTray',1,840,''),(91,'2023-06-15 21:37:00','Sirius','通用Tray',1,2610,''),(92,'2023-06-15 21:37:00','Milan','通用Tray',1,4200,''),(93,'2023-06-15 21:37:00','Milan','切割',1,840,''),(94,'2023-06-15 21:37:00','Yala','通用Tray',1,1440,''),(95,'2023-06-15 21:37:00','Tiger','切割',1,840,''),(96,'2023-06-15 21:37:00','Tiger','平贴',1,2520,''),(97,'2023-06-15 21:37:00','Tiger','3D贴合',1,1680,''),(98,'2023-06-15 21:37:00','Venice','CGTray',1,2520,''),(99,'2023-06-16 14:28:00','Anman','POL下料Tray',1,752,''),(100,'2023-06-16 14:49:00','Anman','POL下料Tray',1,39,''),(101,'2023-06-18 08:45:00','Anman','CGTray',1,300,''),(102,'2023-06-18 08:45:00','Tiger','切割',0,350,''),(103,'2023-06-18 08:45:00','Sirius','通用Tray',0,1070,''),(104,'2023-06-18 08:45:00','Amber','2.5D贴合',0,1100,'');
/*!40000 ALTER TABLE `tray_outside` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tray_user`
--

DROP TABLE IF EXISTS `tray_user`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `tray_user` (
  `Id` int(11) NOT NULL AUTO_INCREMENT,
  `user_id` varchar(255) NOT NULL DEFAULT '',
  `password` varchar(255) NOT NULL DEFAULT '',
  `mail` varchar(255) NOT NULL DEFAULT '',
  `deleted` varchar(255) NOT NULL DEFAULT '0',
  `grade` int(1) NOT NULL DEFAULT '0',
  PRIMARY KEY (`Id`)
) ENGINE=MyISAM AUTO_INCREMENT=3 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tray_user`
--

LOCK TABLES `tray_user` WRITE;
/*!40000 ALTER TABLE `tray_user` DISABLE KEYS */;
INSERT INTO `tray_user` VALUES (1,'10280080','17000009940','lognn@qq.com','0',1),(2,'10503830','10503830','10503830@qq.com','0',0);
/*!40000 ALTER TABLE `tray_user` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tray_yard`
--

DROP TABLE IF EXISTS `tray_yard`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `tray_yard` (
  `Id` int(11) NOT NULL AUTO_INCREMENT,
  `date` varchar(255) NOT NULL DEFAULT '',
  `name` varchar(255) NOT NULL DEFAULT '',
  `type` varchar(255) NOT NULL DEFAULT '',
  `state` int(11) NOT NULL DEFAULT '0',
  `number` int(11) NOT NULL DEFAULT '0',
  `notes` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`Id`)
) ENGINE=MyISAM AUTO_INCREMENT=2 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tray_yard`
--

LOCK TABLES `tray_yard` WRITE;
/*!40000 ALTER TABLE `tray_yard` DISABLE KEYS */;
/*!40000 ALTER TABLE `tray_yard` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping events for database 'jdbc'
--

--
-- Dumping routines for database 'jdbc'
--
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2023-06-18  9:36:27
